# -*- coding: utf-8 -*-

data = \
    {
        'SkillQ':
            {
                'id': 1,
                'name': "羽箭",
                'quality': 0.1,
                'levelSpLimit': {1: 100, 2: 200, 3: 300, 4: 400, 5: 500, 6: 600, 7: 700, 8: 800, 9: 900},
                'strategies': ["一次伤害策略"]
            },
        'SkillW':
            {
                'id': 2,
                'name': '碎石阵',
                'quality': 0.2,
                'levelSpLimit': {1: 100, 2: 200, 3: 300, 4: 400, 5: 500, 6: 600, 7: 700, 8: 800, 9: 900},
                'strategies': ["伤害策略"]
            },
        'SkillE':
            {
                'id': 3,
                'name': '寒冰刺',
                'quality': 0.2,
                'levelSpLimit': {1: 100, 2: 200, 3: 300, 4: 400, 5: 500, 6: 600, 7: 700, 8: 800, 9: 900},
                'strategies': ["伤害策略", "禁锢策略", "冰霜策略"]
            },
        'SkillR':
            {
                'id': 4,
                'name': '紫灵捆',
                'quality': 0.2,
                'levelSpLimit': {1: 100, 2: 200, 3: 300, 4: 400, 5: 500, 6: 600, 7: 700, 8: 800, 9: 900},
                'strategies': ["一次伤害策略", "减速策略", "紫灵捆策略"]
            }
    }

allData = {'角色技能数据': data, }
