# -*- coding: utf-8 -*-

data = \
    {
        1: { "spaceUID": 1, 'spaceName': 'MuLingCunSpace', 'cityName': '木灵村', '重生点': (123.0, 0.0, 96.0), 
                '触发器数据':
                    {
                        1:
                            {
                                '触发器类型': 'GateWay',
                                '触发器坐标': (450.0, 0.0, 450.0),
                                '目标场景': '2',
                                '传送门入口点': (40.0, 0.0, 20.0)
                            }
                    },
                '擂台数据': 
                    {
                        '擂台坐标': (250.0, 0.0, 125.0),
                        '擂台ID': 1,
                        '擂台中心坐标': (250.0, 0.0, 150.0),
                        '排异强制坐标': (200.0, 0.0, 110.0)
                    }
            },
        2: { "spaceUID": 2, 'spaceName': 'YunLingZongSpace', 'cityName': '云灵宗', '重生点': (50.0, 0.0, 100.0),
                '触发器数据':
                    {
                        1:
                            {
                                '触发器类型': 'GateWay',
                                '触发器坐标': (20.0, 1.0, 20.0),
                                '目标场景': '1',
                                '传送门入口点': (440.0, 0.0, 440.0)
                            }
                    }
                # '擂台数据': 
                #     {
                #         '擂台坐标': (250.0, 0.0, 125.0),
                #         '擂台ID': 2,
                #         '擂台中心坐标': (250.0, 0.0, 150.0),
                #         '排异强制坐标': (200.0, 0.0, 110.0)
                #     }
            }
    }
